# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'stripe/stripe-cli'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'curl'
brew 'ffmpeg' # video stream processing and more
brew 'gh' # github cli
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'htop' # better top
brew 'httpie' # more user friendly curl
brew 'hub' # extended github commands for git command line
brew 'lastpass-cli' # lastpass command line access
brew 'mackup' # backups to various clouds
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'stripe/stripe-cli/stripe'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'zlib' # Needed for Memcached

# Spatie Medialibrary
brew 'jpegoptim' # jpeg optimization
brew 'optipng' # png optimization
brew 'pngquant' # png optimization
brew 'svgo' # svg optimization
brew 'gifsicle' # gif animation editor

# Development
brew 'graphviz' # progmattic creation of graphs (used by diagrams python module)
brew 'imagemagick' # image manipulation libraries
brew 'libmemcached' # progmattic extensions for memcache
brew 'libsodium' # NaCl networking and cryptography library
brew 'memcached'
brew 'mysql-client@5.7', link: true
brew 'nginx'
brew 'node'
brew 'openssh', link: true
brew 'openssl'
brew 'postgresql'
brew 'redis'
brew 'svn'
brew 'yarn'

# Apps
cask 'aerial' # apple tv aerial video screensavers
cask 'alfred' # spotlight replacement
cask 'authy' # google authenticator cross platform
cask 'brave-browser' # better chromium based browser
cask 'caffeine' # keep your mac awake
cask 'dbngin' # manage multiple database engines and versions in a gui
cask 'discord' # widely used chat and voice comm platform
cask 'docker'
cask 'dropbox' # cloud file storage
# cask 'firefox'
cask 'github'
cask 'google-backup-and-sync'
# cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim' # debloats images
cask 'insomnia' # api design and testing GUI app
cask 'ipvanish-vpn' # top end vpn client with many countries of vpn servers
cask 'iterm2' # better terminal
cask 'lastpass' # password manager
cask 'microsoft-edge' # microsoft's chromium based browser
cask 'phantomjs' # progmattic testing of web guis
cask 'ray' # ruby & node.js debugger gui
cask 'rubymine' # jetbrains ruby ide
cask 'signal' # secure encrypted messaging
# cask 'skype'
# cask 'slack'
cask 'sourcetree' # free git gui
cask 'steam' # games
cask 'sublime-text' # old faithful editor
cask 'switchresx' # ultimate tool for mac screen resolutions
cask 'tableplus' # database management
cask 'the-unarchiver' # better archive manager
cask 'tower' # advanced git gui
cask 'transmission' # torrent manager
cask 'transmit' # file transfer manager
cask 'visual-studio-code' # microsoft's code editor
cask 'vlc' # swiss army knife of video viewing tools
cask 'zoom' # popular teleconference tool

# Quicklook
cask 'qlmarkdown' # quick look for markdown
cask 'quicklook-json' # quick look for json

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
